// 𝚌𝚊𝚝𝚎𝚐𝚘𝚛𝚢𝙵𝚒𝚕𝚝𝚎𝚛.𝚓𝚜
𝚒𝚖𝚙𝚘𝚛𝚝 {𝙻𝚒𝚐𝚑𝚝𝚗𝚒𝚗𝚐𝙴𝚕𝚎𝚖𝚎𝚗𝚝} 𝚏𝚛𝚘𝚖 '𝚕𝚠𝚌';

𝚎𝚡𝚙𝚘𝚛𝚝 𝚍𝚎𝚏𝚊𝚞𝚕𝚝 𝚌𝚕𝚊𝚜𝚜 𝙲𝚊𝚝𝚎𝚐𝚘𝚛𝚢𝙵𝚒𝚕𝚝𝚎𝚛 𝚎𝚡𝚝𝚎𝚗𝚍𝚜 𝙻𝚒𝚐𝚑𝚝𝚗𝚒𝚗𝚐𝙴𝚕𝚎𝚖𝚎𝚗𝚝 {
  
𝚑𝚊𝚗𝚍𝚕𝚎𝙲𝚑𝚎𝚌𝚔𝚋𝚘𝚡𝙲𝚑𝚊𝚗𝚐𝚎() {

𝚌𝚘𝚗𝚜𝚝 𝚏𝚒𝚕𝚝𝚎𝚛𝙲𝚑𝚊𝚗𝚐𝚎𝙴𝚟𝚎𝚗𝚝 = 𝚗𝚎𝚠 𝙲𝚞𝚜𝚝𝚘𝚖𝙴𝚟𝚎𝚗𝚝('𝚏𝚒𝚕𝚝𝚎𝚛𝚌𝚑𝚊𝚗𝚐𝚎', {
              𝚍𝚎𝚝𝚊𝚒𝚕: {
                𝚗𝚊𝚖𝚎: '𝚝𝚎𝚓𝚊',
                𝚊𝚐𝚎: 𝟷00,
                𝚝𝚛𝚊𝚟𝚎𝚕𝚕𝚒𝚗𝚐: 𝚝𝚛𝚞𝚎
                },
              });
          // 𝙵𝚒𝚛𝚎 𝚝𝚑𝚎 𝚌𝚞𝚜𝚝𝚘𝚖 𝚎𝚟𝚎𝚗𝚝
         𝚝𝚑𝚒𝚜.𝚍𝚒𝚜𝚙𝚊𝚝𝚌𝚑𝙴𝚟𝚎𝚗𝚝(𝚏𝚒𝚕𝚝𝚎𝚛𝙲𝚑𝚊𝚗𝚐𝚎𝙴𝚟𝚎𝚗𝚝);
      }
}

// 𝚊𝚞𝚛𝚊𝙳𝚘𝚖𝙴𝚟𝚎𝚗𝚝𝙻𝚒𝚜𝚝𝚎𝚗𝚎𝚛.𝚌𝚖𝚙
  <𝚊𝚞𝚛𝚊: 𝚌𝚘𝚖𝚙𝚘𝚗𝚎𝚗𝚝 𝚒𝚖𝚙𝚕𝚎𝚖𝚎𝚗𝚝𝚜 = "𝚏𝚕𝚎𝚡𝚒𝚙𝚊𝚐𝚎:𝚊𝚟𝚊𝚒𝚕𝚊𝚋𝚕𝚎𝙵𝚘𝚛𝙰𝚕𝚕𝙿𝚊𝚐𝚎𝚃𝚢𝚙𝚎𝚜">
      // 𝚃𝚑𝚒𝚜 𝚒𝚜 𝚊𝚗 𝙻𝚆𝙲 𝚌𝚘𝚖𝚙𝚘𝚗𝚎𝚗𝚝
      <𝚌:𝚌𝚊𝚝𝚎𝚐𝚘𝚛𝚢𝙵𝚒𝚕𝚝𝚎𝚛 𝚘𝚗𝚏𝚒𝚕𝚝𝚎𝚛𝚌𝚑𝚊𝚗𝚐𝚎="{!𝚌.𝚑𝚊𝚗𝚍𝚕𝚎𝙵𝚒𝚕𝚝𝚎𝚛𝙲𝚑𝚊𝚗𝚐𝚎}" />
  </𝚊𝚞𝚛𝚊:𝚌𝚘𝚖𝚙𝚘𝚗𝚎𝚗𝚝>

// 𝚊𝚞𝚛𝚊𝙳𝚘𝚖𝙴𝚟𝚎𝚗𝚝𝙻𝚒𝚜𝚝𝚎𝚗𝚎𝚛𝙲𝚘𝚗𝚝𝚛𝚘𝚕𝚕𝚎𝚛.𝚓𝚜
({
    𝚑𝚊𝚗𝚍𝚕𝚎𝙵𝚒𝚕𝚝𝚎𝚛𝙲𝚑𝚊𝚗𝚐𝚎: 𝚏𝚞𝚗𝚌𝚝𝚒𝚘𝚗(𝚌𝚘𝚖𝚙𝚘𝚗𝚎𝚗𝚝, 𝚎𝚟𝚎𝚗𝚝) {
      𝚟𝚊𝚛 𝚏𝚒𝚕𝚝𝚎𝚛𝚜 = 𝚎𝚟𝚎𝚗𝚝.𝚐𝚎𝚝𝙿𝚊𝚛𝚊𝚖('𝚏𝚒𝚕𝚝𝚎𝚛𝚜');
      // 𝚍𝚘 𝚜𝚘𝚖𝚎𝚝𝚑𝚒𝚗𝚐
    },
});
